{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import xml.etree.ElementTree as ET"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "tree = ET.parse('/Users/arthur_0804/Desktop/Thesis/RelevantDocs/topics2017.xml')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "root = tree.getroot()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "disease_list = []\n",
    "for i in range(0,30):\n",
    "        disease_list.append(root[i][0].text)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# function of getting mesh id from Wikidata\n",
    "def getMeshIDFromLabel(disease):\n",
    "    sparql = SPARQLWrapper(\"https://query.wikidata.org/bigdata/namespace/wdq/sparql\")\n",
    "    disease = disease.lower()\n",
    "    disease = \"\"\"'\"\"\" + disease + \"\"\"'\"\"\"\n",
    "    # first we need to get the label\n",
    "    query = \"\"\"PREFIX wikibase: <http://wikiba.se/ontology#>\n",
    "                PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "                PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "                PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "                SELECT ?s ?p ?o\n",
    "                WHERE { ?s rdfs:label\"\"\" + disease + \"\"\"@en}\"\"\"\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    results = sparql.query().convert()\n",
    "    result = results[\"results\"][\"bindings\"]\n",
    "    if len(result) > 0:\n",
    "        # retrieve the result from Wikidata\n",
    "        label = result[0][\"s\"][\"value\"]\n",
    "        # make it as a subject URI\n",
    "        subject = \"\"\"<\"\"\" + label + \"\"\">\"\"\"\n",
    "        sparql = SPARQLWrapper(\"https://query.wikidata.org/bigdata/namespace/wdq/sparql\")\n",
    "        # then use the label as subject to retrieve\n",
    "        # wdt:P486 is the predicate for mesh id\n",
    "        query = \"\"\"PREFIX wikibase: <http://wikiba.se/ontology#>\n",
    "                PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "                PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "                PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "                SELECT ?o WHERE { \"\"\" + subject + \"\"\" wdt:P486 ?o.}\"\"\"\n",
    "        sparql.setQuery(query)\n",
    "        sparql.setReturnFormat(JSON)\n",
    "        results = sparql.query().convert()\n",
    "        result = results[\"results\"][\"bindings\"]\n",
    "        if len(result) > 0:\n",
    "            # get mesh id\n",
    "            meshid = result[0][\"o\"][\"value\"]\n",
    "        else:\n",
    "            # 1 indicates no result because there is no predicate of \"meshid\"\n",
    "            meshid = \"1\"\n",
    "    else:\n",
    "        # 2 indicates no result because this term does not exist in Wikidata\n",
    "        # we can try aliases or dbpedia\n",
    "        meshid = \"2\"\n",
    "    return meshid"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "disease_dict_mesh = {}\n",
    "# put the result into the dictionary\n",
    "for x in disease_list:\n",
    "    meshid = getMeshIDFromLabel(x)\n",
    "    disease_dict_mesh[x] = meshid"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Disease: Liposarcoma; MeSH ID: D008080\n",
      "Disease: Colon cancer; MeSH ID: D003110\n",
      "Disease: Meningioma; MeSH ID: D008579\n",
      "Disease: Breast cancer; MeSH ID: D001943\n",
      "Disease: Melanoma; MeSH ID: D008545\n",
      "Disease: Lung cancer; MeSH ID: D008175\n",
      "Disease: Gastrointestinal stromal tumor; MeSH ID: D046152\n",
      "no result because this term does not exist in Wikidata Disease: Lung adenocarcinoma; MeSH ID: 2\n",
      "no result because this term does not exist in Wikidata Disease: Gastric cancer; MeSH ID: 2\n",
      "Disease: Cholangiocarcinoma; MeSH ID: D018281\n",
      "Disease: Cervical cancer; MeSH ID: D002583\n",
      "Disease: Pancreatic cancer; MeSH ID: D010190\n",
      "Disease: Prostate cancer; MeSH ID: D011471\n",
      "Disease: Colorectal cancer; MeSH ID: D015179\n",
      "no result because there is no predicate of 'meshid' Disease: Pancreatic adenocarcinoma; MeSH ID: 1\n",
      "Disease: Pancreatic ductal adenocarcinoma; MeSH ID: D021441\n",
      "no result because this term does not exist in Wikidata Disease: Ampullary carcinoma; MeSH ID: 2\n"
     ]
    }
   ],
   "source": [
    "for (k,v) in  disease_dict_mesh.items(): \n",
    "    if(v == '1'):\n",
    "        print(\"no result because there is no predicate of 'meshid' Disease: {}; MeSH ID: {}\".format(k,v))\n",
    "    elif (v == '2'):\n",
    "        print(\"no result because this term does not exist in Wikidata Disease: {}; MeSH ID: {}\".format(k,v))\n",
    "    else:\n",
    "        print(\"Disease: {}; MeSH ID: {}\".format(k,v))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "There are some terms which may use other names, and names in our data set are aliases"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "def getMeshIDFromAlias(disease):\n",
    "    sparql = SPARQLWrapper(\"https://query.wikidata.org/bigdata/namespace/wdq/sparql\")\n",
    "    disease = disease.lower()\n",
    "    disease = \"\"\"'\"\"\" + disease + \"\"\"'\"\"\"\n",
    "    query = \"\"\"PREFIX wikibase: <http://wikiba.se/ontology#>\n",
    "                PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "                PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "                PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "                PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "                select ?s\n",
    "                where{ ?s <http://www.w3.org/2004/02/skos/core#altLabel>\"\"\" + disease +\"\"\"@en .}\"\"\"\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    results = sparql.query().convert()\n",
    "    result = results[\"results\"][\"bindings\"]\n",
    "    if len(result) > 0:\n",
    "        altLabel = result[0][\"s\"][\"value\"]\n",
    "        # make it as a subject URI\n",
    "        subject = \"\"\"<\"\"\" + altLabel + \"\"\">\"\"\"\n",
    "        sparql = SPARQLWrapper(\"https://query.wikidata.org/bigdata/namespace/wdq/sparql\")\n",
    "        # then use the label as subject to retrieve\n",
    "        # wdt:P486 is the predicate for mesh id\n",
    "        query = \"\"\"PREFIX wikibase: <http://wikiba.se/ontology#>\n",
    "                PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "                PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "                PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "                SELECT ?o WHERE { \"\"\" + subject + \"\"\" wdt:P486 ?o.}\"\"\"\n",
    "        sparql.setQuery(query)\n",
    "        sparql.setReturnFormat(JSON)\n",
    "        results = sparql.query().convert()\n",
    "        result = results[\"results\"][\"bindings\"]\n",
    "        \n",
    "        if len(result) > 0:\n",
    "            # get mesh id\n",
    "            meshid = result[0][\"o\"][\"value\"]\n",
    "        else:\n",
    "            # 1 indicates no result because there is no predicate of \"meshid\"\n",
    "            meshid = \"1\"    \n",
    "    else:\n",
    "        # still cannot find this entity\n",
    "        meshid = \"2\"\n",
    "        \n",
    "    return meshid"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "for (k,v) in  disease_dict_mesh.items(): \n",
    "    if(v == '2'):\n",
    "        meshid = getMeshIDFromAlias(k)\n",
    "        disease_dict_mesh[k] = meshid"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Liposarcoma D008080\n",
      "Colon cancer D003110\n",
      "Meningioma D008579\n",
      "Breast cancer D001943\n",
      "Melanoma D008545\n",
      "Lung cancer D008175\n",
      "Gastrointestinal stromal tumor D046152\n",
      "Lung adenocarcinoma D008175\n",
      "Gastric cancer D013274\n",
      "Cholangiocarcinoma D018281\n",
      "Cervical cancer D002583\n",
      "Pancreatic cancer D010190\n",
      "Prostate cancer D011471\n",
      "Colorectal cancer D015179\n",
      "Pancreatic adenocarcinoma D010190\n",
      "Pancreatic ductal adenocarcinoma D021441\n",
      "Ampullary carcinoma 1\n"
     ]
    }
   ],
   "source": [
    "disease_dict_mesh['Pancreatic adenocarcinoma'] = 'D010190'\n",
    "disease_dict_mesh['Lung adenocarcinoma'] = \"D008175\"\n",
    "for (k,v) in disease_dict_mesh.items():\n",
    "    print(k,v)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def getDiseaseName(id):\n",
    "    '''\n",
    "    Get the MeSH label for a given MeSH id\n",
    "    '''\n",
    "        \n",
    "    if id != \"None\":\n",
    "        subject = \"\"\"mesh:\"\"\" + id\n",
    "        sparql = SPARQLWrapper(\"http://id.nlm.nih.gov/mesh/sparql\")\n",
    "        sparql.setQuery(\"\"\"\n",
    "            PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "            PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "            PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "            PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "            PREFIX meshv: <http://id.nlm.nih.gov/mesh/vocab#>\n",
    "            PREFIX mesh: <http://id.nlm.nih.gov/mesh/>\n",
    "            PREFIX mesh2015: <http://id.nlm.nih.gov/mesh/2015/>\n",
    "            PREFIX mesh2016: <http://id.nlm.nih.gov/mesh/2016/>\n",
    "            PREFIX mesh2017: <http://id.nlm.nih.gov/mesh/2017/>\n",
    "            PREFIX mesh2018: <http://id.nlm.nih.gov/mesh/2018/>\n",
    "            PREFIX mesh2019: <http://id.nlm.nih.gov/mesh/2019/>\n",
    "            SELECT DISTINCT ?s ?p ?o\n",
    "            FROM <http://id.nlm.nih.gov/mesh>\n",
    "            WHERE {\"\"\" + subject + \"\"\" <http://www.w3.org/2000/01/rdf-schema#label>  ?o.}\"\"\")\n",
    "        sparql.setReturnFormat(JSON)\n",
    "        results = sparql.query().convert()\n",
    "        result = results[\"results\"][\"bindings\"]\n",
    "        if len(result) > 0:\n",
    "            return result[0][\"o\"][\"value\"]\n",
    "        else:\n",
    "            return \"None\"\n",
    "    else:\n",
    "        return \"None\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Liposarcoma'"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "getDiseaseName(\"D008080\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This function returns the MeSH tree node by MeSH ID"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "def getDiseaseTreeNode(id):\n",
    "    '''\n",
    "    Get the MeSH node id for a given MeSH id\n",
    "    '''\n",
    "        \n",
    "    subject = \"\"\"mesh:\"\"\" + id\n",
    "    sparql = SPARQLWrapper(\"http://id.nlm.nih.gov/mesh/sparql\")\n",
    "    sparql.setQuery(\"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "        PREFIX meshv: <http://id.nlm.nih.gov/mesh/vocab#>\n",
    "        PREFIX mesh: <http://id.nlm.nih.gov/mesh/>\n",
    "        PREFIX mesh2015: <http://id.nlm.nih.gov/mesh/2015/>\n",
    "        PREFIX mesh2016: <http://id.nlm.nih.gov/mesh/2016/>\n",
    "        PREFIX mesh2017: <http://id.nlm.nih.gov/mesh/2017/>\n",
    "        PREFIX mesh2018: <http://id.nlm.nih.gov/mesh/2018/>\n",
    "        PREFIX mesh2019: <http://id.nlm.nih.gov/mesh/2019/>\n",
    "        SELECT DISTINCT ?s ?p ?o\n",
    "        FROM <http://id.nlm.nih.gov/mesh>\n",
    "        WHERE {\"\"\" + subject + \"\"\" meshv:treeNumber  ?o.}\"\"\")\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    results = sparql.query().convert()\n",
    "    result = results[\"results\"][\"bindings\"]\n",
    "    \n",
    "    tree_node_list = []\n",
    "    if len(result) > 0:\n",
    "        for i in result:\n",
    "            tree_node_list.append(i[\"o\"][\"value\"])\n",
    "    \n",
    "    for i in range(0,len(tree_node_list)):\n",
    "        tree_node_list[i] = tree_node_list[i][27:]\n",
    "    \n",
    "    return tree_node_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['C04.557.450.550.420', 'C04.557.450.795.465']"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "getDiseaseTreeNode(\"D008080\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# we only use the disease part (starts with \"C\")\n",
    "records = []\n",
    "meshFile = '/Users/arthur_0804/Desktop/mtrees2019.bin'\n",
    "with open(meshFile, mode='r') as file:\n",
    "    for line in file:\n",
    "        record = [x.strip() for x in line.split(\";\")]\n",
    "        if record[1][0] == \"C\":\n",
    "            records.append(record)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "def getParentNode(nodeid):\n",
    "    '''\n",
    "    Get the parent node id for a given node\n",
    "    '''\n",
    "    return nodeid[:-4]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "def getChildrenNode(nodeid):\n",
    "    '''\n",
    "    Get all the chilren node id for a given node\n",
    "    '''\n",
    "    children = []\n",
    "    for record in records:\n",
    "        tree_node = record[1]\n",
    "        if (tree_node[:len(nodeid)] == nodeid) and (tree_node != nodeid) and (len(tree_node)-len(nodeid) == 4):\n",
    "            children.append(tree_node)\n",
    "    return children"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "def getAllTerms(nodeid):\n",
    "    '''\n",
    "    Get the parent/children/sibling/sibling's children node id for a given node\n",
    "    '''\n",
    "    \n",
    "    results = []\n",
    "    \n",
    "    # get parent\n",
    "    parent_node = getParentNode(nodeid)\n",
    "    results.append(parent_node)\n",
    "    \n",
    "    # get children\n",
    "    results += getChildrenNode(nodeid)\n",
    "    \n",
    "    # get siblings\n",
    "    siblings = getChildrenNode(parent_node)\n",
    "    results += siblings\n",
    "    \n",
    "    # get siblings' children\n",
    "    for sibling in siblings:\n",
    "        sibling_children = getChildrenNode(sibling)\n",
    "        results += sibling_children\n",
    "    \n",
    "    return results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['C04.557.450.550',\n",
       " 'C04.557.450.550.420.425',\n",
       " 'C04.557.450.550.100',\n",
       " 'C04.557.450.550.125',\n",
       " 'C04.557.450.550.400',\n",
       " 'C04.557.450.550.420',\n",
       " 'C04.557.450.550.710',\n",
       " 'C04.557.450.550.400.500',\n",
       " 'C04.557.450.550.420.425']"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# test\n",
    "getAllTerms(\"C04.557.450.550.420\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "def getMeshidByNode(nodeid):\n",
    "    '''\n",
    "    Get the MeSH id for a given node id\n",
    "    '''\n",
    "    \n",
    "    node = \"\"\"mesh:\"\"\" + nodeid\n",
    "    sparql = SPARQLWrapper(\"http://id.nlm.nih.gov/mesh/sparql\")\n",
    "    sparql.setQuery(\"\"\"\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "        PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "        PREFIX meshv: <http://id.nlm.nih.gov/mesh/vocab#>\n",
    "        PREFIX mesh: <http://id.nlm.nih.gov/mesh/>\n",
    "        PREFIX mesh2015: <http://id.nlm.nih.gov/mesh/2015/>\n",
    "        PREFIX mesh2016: <http://id.nlm.nih.gov/mesh/2016/>\n",
    "        PREFIX mesh2017: <http://id.nlm.nih.gov/mesh/2017/>\n",
    "        PREFIX mesh2018: <http://id.nlm.nih.gov/mesh/2018/>\n",
    "        PREFIX mesh2019: <http://id.nlm.nih.gov/mesh/2019/>\n",
    "        SELECT DISTINCT ?s ?p ?o\n",
    "        FROM <http://id.nlm.nih.gov/mesh>\n",
    "        WHERE { ?s meshv:treeNumber \"\"\" +  node + \"\"\"}\"\"\")\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    results = sparql.query().convert()\n",
    "    result = results[\"results\"][\"bindings\"]\n",
    "    \n",
    "    return result[0][\"s\"][\"value\"][27:]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'D008080'"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# test\n",
    "getMeshidByNode(\"C04.557.450.795.465\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "D018205\n",
      "D018208\n",
      "D018206\n",
      "D018207\n",
      "D008067\n",
      "D008080\n",
      "D018209\n",
      "D062689\n",
      "D018208\n"
     ]
    }
   ],
   "source": [
    "# test\n",
    "for node in getAllTerms(\"C04.557.450.550.420\"):\n",
    "    print(getMeshidByNode(node))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "disease: Liposarcoma\n",
      "\tnode: C04.557.450.550.420\n",
      "\t\tNeoplasms, Adipose Tissue\n",
      "\t\tLiposarcoma, Myxoid\n",
      "\t\tAngiolipoma\n",
      "\t\tAngiomyolipoma\n",
      "\t\tLipoma\n",
      "\t\tLiposarcoma\n",
      "\t\tMyelolipoma\n",
      "\t\tLipoblastoma\n",
      "\t\tLiposarcoma, Myxoid\n",
      "\tnode: C04.557.450.795.465\n",
      "\t\tSarcoma\n",
      "\t\tLiposarcoma, Myxoid\n",
      "\t\tAdenosarcoma\n",
      "\t\tCarcinosarcoma\n",
      "\t\tChondrosarcoma\n",
      "\t\tDesmoplastic Small Round Cell Tumor\n",
      "\t\tEndometrial Stromal Tumors\n",
      "\t\tFibrosarcoma\n",
      "\t\tHemangiosarcoma\n",
      "\t\tHistiocytoma, Malignant Fibrous\n",
      "\t\tLeiomyosarcoma\n",
      "\t\tLiposarcoma\n",
      "\t\tLymphangiosarcoma\n",
      "\t\tMixed Tumor, Mesodermal\n",
      "\t\tMyosarcoma\n",
      "\t\tMyxosarcoma\n",
      "\t\tOsteosarcoma\n",
      "\t\tPhyllodes Tumor\n",
      "\t\tSarcoma, Alveolar Soft Part\n",
      "\t\tSarcoma, Clear Cell\n",
      "\t\tSarcoma, Experimental\n",
      "\t\tSarcoma, Kaposi\n",
      "\t\tSarcoma, Myeloid\n",
      "\t\tSarcoma, Small Cell\n",
      "\t\tSarcoma, Synovial\n",
      "\t\tCarcinoma 256, Walker\n",
      "\t\tChondrosarcoma, Clear Cell\n",
      "\t\tChondrosarcoma, Mesenchymal\n",
      "\t\tSarcoma, Endometrial Stromal\n",
      "\t\tDermatofibrosarcoma\n",
      "\t\tNeurofibrosarcoma\n",
      "\t\tLiposarcoma, Myxoid\n",
      "\t\tRhabdomyosarcoma\n",
      "\t\tOsteosarcoma, Juxtacortical\n",
      "\t\tSarcoma, Ewing\n",
      "\t\tSarcoma 37\n",
      "\t\tSarcoma 180\n",
      "\t\tSarcoma, Avian\n",
      "\t\tSarcoma, Yoshida\n",
      "disease: Colon cancer\n",
      "\tnode: C06.301.371.411.307.180\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tSigmoid Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tRectal Neoplasms\n",
      "\t\tGardner Syndrome\n",
      "\t\tSigmoid Neoplasms\n",
      "\t\tAnus Neoplasms\n",
      "\tnode: C06.405.249.411.307.180\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tSigmoid Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tRectal Neoplasms\n",
      "\t\tGardner Syndrome\n",
      "\t\tSigmoid Neoplasms\n",
      "\t\tAnus Neoplasms\n",
      "\tnode: C06.405.469.158.356.180\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tSigmoid Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tGardner Syndrome\n",
      "\t\tSigmoid Neoplasms\n",
      "\tnode: C06.405.469.491.307.180\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tSigmoid Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tRectal Neoplasms\n",
      "\t\tGardner Syndrome\n",
      "\t\tSigmoid Neoplasms\n",
      "\t\tAnus Neoplasms\n",
      "\tnode: C04.588.274.476.411.307.180\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tSigmoid Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tRectal Neoplasms\n",
      "\t\tGardner Syndrome\n",
      "\t\tSigmoid Neoplasms\n",
      "\t\tAnus Neoplasms\n",
      "disease: Meningioma\n",
      "\tnode: C04.557.580.520\n",
      "\t\tNeoplasms, Nerve Tissue\n",
      "\t\tMeningioma\n",
      "\t\tNerve Sheath Neoplasms\n",
      "\t\tNeuroectodermal Tumors\n",
      "\t\tNeurofibroma\n",
      "\t\tNeuroma\n",
      "\t\tNeurothekeoma\n",
      "\t\tCraniopharyngioma\n",
      "\t\tNeoplasms, Neuroepithelial\n",
      "\t\tNeuroectodermal Tumor, Melanotic\n",
      "\t\tNeuroendocrine Tumors\n",
      "\tnode: C04.557.645.520\n",
      "\t\tNeoplasms, Vascular Tissue\n",
      "\t\tAngiofibroma\n",
      "\t\tAngiokeratoma\n",
      "\t\tGlomus Tumor\n",
      "\t\tHemangioma\n",
      "\t\tHemangiopericytoma\n",
      "\t\tHemangiosarcoma\n",
      "\t\tMeningioma\n",
      "\t\tSarcoma, Kaposi\n",
      "\t\tCentral Nervous System Venous Angioma\n",
      "\t\tHemangioendothelioma\n",
      "\t\tHemangioma, Capillary\n",
      "\t\tHemangioma, Cavernous\n",
      "\t\tKasabach-Merritt Syndrome\n",
      "\t\tSturge-Weber Syndrome\n",
      "\t\tMyopericytoma\n",
      "\tnode: C04.588.614.250.580.500\n",
      "\t\tMeningeal Neoplasms\n",
      "\t\tMeningeal Carcinomatosis\n",
      "\t\tMeningioma\n",
      "\tnode: C10.551.240.500.500\n",
      "\t\tMeningeal Neoplasms\n",
      "\t\tMeningeal Carcinomatosis\n",
      "\t\tMeningioma\n",
      "disease: Breast cancer\n",
      "\tnode: C17.800.090.500\n",
      "\t\tBreast Diseases\n",
      "\t\tBreast Carcinoma In Situ\n",
      "\t\tBreast Neoplasms, Male\n",
      "\t\tCarcinoma, Ductal, Breast\n",
      "\t\tCarcinoma, Lobular\n",
      "\t\tHereditary Breast and Ovarian Cancer Syndrome\n",
      "\t\tInflammatory Breast Neoplasms\n",
      "\t\tUnilateral Breast Neoplasms\n",
      "\t\tTriple Negative Breast Neoplasms\n",
      "\t\tBreast Cyst\n",
      "\t\tBreast Neoplasms\n",
      "\t\tFibrocystic Breast Disease\n",
      "\t\tGynecomastia\n",
      "\t\tLactation Disorders\n",
      "\t\tMastitis\n",
      "\t\tBreast Carcinoma In Situ\n",
      "\t\tBreast Neoplasms, Male\n",
      "\t\tCarcinoma, Ductal, Breast\n",
      "\t\tCarcinoma, Lobular\n",
      "\t\tHereditary Breast and Ovarian Cancer Syndrome\n",
      "\t\tInflammatory Breast Neoplasms\n",
      "\t\tUnilateral Breast Neoplasms\n",
      "\t\tTriple Negative Breast Neoplasms\n",
      "\t\tGalactorrhea\n",
      "\t\tGranulomatous Mastitis\n",
      "disease: Melanoma\n",
      "\tnode: C04.557.465.625.650.510\n",
      "\t\tNeuroendocrine Tumors\n",
      "\t\tHutchinson's Melanotic Freckle\n",
      "\t\tMelanoma, Amelanotic\n",
      "\t\tMelanoma, Experimental\n",
      "\t\tAdenoma, Acidophil\n",
      "\t\tAdenoma, Basophil\n",
      "\t\tAdenoma, Chromophobe\n",
      "\t\tApudoma\n",
      "\t\tCarcinoid Tumor\n",
      "\t\tCarcinoma, Neuroendocrine\n",
      "\t\tMelanoma\n",
      "\t\tNeurilemmoma\n",
      "\t\tParaganglioma\n",
      "\t\tMalignant Carcinoid Syndrome\n",
      "\t\tCarcinoma, Medullary\n",
      "\t\tCarcinoma, Merkel Cell\n",
      "\t\tSomatostatinoma\n",
      "\t\tVipoma\n",
      "\t\tHutchinson's Melanotic Freckle\n",
      "\t\tMelanoma, Amelanotic\n",
      "\t\tMelanoma, Experimental\n",
      "\t\tNeuroma, Acoustic\n",
      "\t\tParaganglioma, Extra-Adrenal\n",
      "\t\tPheochromocytoma\n",
      "\tnode: C04.557.580.625.650.510\n",
      "\t\tNeuroendocrine Tumors\n",
      "\t\tHutchinson's Melanotic Freckle\n",
      "\t\tMelanoma, Amelanotic\n",
      "\t\tMelanoma, Experimental\n",
      "\t\tAdenoma, Acidophil\n",
      "\t\tAdenoma, Basophil\n",
      "\t\tAdenoma, Chromophobe\n",
      "\t\tApudoma\n",
      "\t\tCarcinoid Tumor\n",
      "\t\tCarcinoma, Neuroendocrine\n",
      "\t\tMelanoma\n",
      "\t\tNeurilemmoma\n",
      "\t\tParaganglioma\n",
      "\t\tMalignant Carcinoid Syndrome\n",
      "\t\tCarcinoma, Medullary\n",
      "\t\tCarcinoma, Merkel Cell\n",
      "\t\tHutchinson's Melanotic Freckle\n",
      "\t\tMelanoma, Amelanotic\n",
      "\t\tMelanoma, Experimental\n",
      "\t\tNeuroma, Acoustic\n",
      "\t\tParaganglioma, Extra-Adrenal\n",
      "\t\tPheochromocytoma\n",
      "\tnode: C04.557.665.510\n",
      "\t\tNevi and Melanomas\n",
      "\t\tHutchinson's Melanotic Freckle\n",
      "\t\tMelanoma, Amelanotic\n",
      "\t\tMelanoma, Experimental\n",
      "\t\tMelanoma\n",
      "\t\tNevus\n",
      "\t\tHutchinson's Melanotic Freckle\n",
      "\t\tMelanoma, Amelanotic\n",
      "\t\tMelanoma, Experimental\n",
      "\t\tDysplastic Nevus Syndrome\n",
      "\t\tNevus, Halo\n",
      "\t\tNevus, Intradermal\n",
      "\t\tNevus, Pigmented\n",
      "\t\tNevus, Sebaceous of Jadassohn\n",
      "disease: Lung cancer\n",
      "\tnode: C04.588.894.797.520\n",
      "\t\tRespiratory Tract Neoplasms\n",
      "\t\tAdenocarcinoma of Lung\n",
      "\t\tBronchial Neoplasms\n",
      "\t\tMultiple Pulmonary Nodules\n",
      "\t\tPancoast Syndrome\n",
      "\t\tPulmonary Blastoma\n",
      "\t\tPulmonary Sclerosing Hemangioma\n",
      "\t\tLung Neoplasms\n",
      "\t\tPleural Neoplasms\n",
      "\t\tTracheal Neoplasms\n",
      "\t\tAdenocarcinoma of Lung\n",
      "\t\tBronchial Neoplasms\n",
      "\t\tMultiple Pulmonary Nodules\n",
      "\t\tPancoast Syndrome\n",
      "\t\tPulmonary Blastoma\n",
      "\t\tPulmonary Sclerosing Hemangioma\n",
      "\t\tPleural Effusion, Malignant\n",
      "\t\tSolitary Fibrous Tumor, Pleural\n",
      "disease: Gastrointestinal stromal tumor\n",
      "\tnode: C06.301.371.308\n",
      "\t\tGastrointestinal Neoplasms\n",
      "\t\tEsophageal Neoplasms\n",
      "\t\tGastrointestinal Stromal Tumors\n",
      "\t\tIntestinal Neoplasms\n",
      "\t\tStomach Neoplasms\n",
      "\t\tZollinger-Ellison Syndrome\n",
      "\t\tEsophageal Squamous Cell Carcinoma\n",
      "\t\tCecal Neoplasms\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tDuodenal Neoplasms\n",
      "\t\tIleal Neoplasms\n",
      "\t\tImmunoproliferative Small Intestinal Disease\n",
      "\t\tJejunal Neoplasms\n",
      "\tnode: C06.405.249.308\n",
      "\t\tGastrointestinal Neoplasms\n",
      "\t\tEsophageal Neoplasms\n",
      "\t\tGastrointestinal Stromal Tumors\n",
      "\t\tIntestinal Neoplasms\n",
      "\t\tStomach Neoplasms\n",
      "\t\tZollinger-Ellison Syndrome\n",
      "\t\tEsophageal Squamous Cell Carcinoma\n",
      "\t\tCecal Neoplasms\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tDuodenal Neoplasms\n",
      "\t\tIleal Neoplasms\n",
      "\t\tImmunoproliferative Small Intestinal Disease\n",
      "\t\tJejunal Neoplasms\n",
      "\tnode: C04.557.450.565.370\n",
      "\t\tNeoplasms, Connective Tissue\n",
      "\t\tChondroblastoma\n",
      "\t\tChondroma\n",
      "\t\tChondrosarcoma\n",
      "\t\tEndometrial Stromal Tumors\n",
      "\t\tGastrointestinal Stromal Tumors\n",
      "\t\tGiant Cell Tumors\n",
      "\t\tMastocytosis\n",
      "\t\tMyofibroma\n",
      "\t\tMyopericytoma\n",
      "\t\tMyxoma\n",
      "\t\tMyxosarcoma\n",
      "\t\tNeoplasms, Bone Tissue\n",
      "\t\tNeoplasms, Fibrous Tissue\n",
      "\t\tSarcoma, Clear Cell\n",
      "\t\tSarcoma, Small Cell\n",
      "\t\tSarcoma, Synovial\n",
      "\t\tChondromatosis\n",
      "\t\tChondrosarcoma, Clear Cell\n",
      "\t\tChondrosarcoma, Mesenchymal\n",
      "\t\tGiant Cell Tumor of Bone\n",
      "\t\tGiant Cell Tumor of Tendon Sheath\n",
      "\t\tMast-Cell Sarcoma\n",
      "\t\tMastocytoma\n",
      "\t\tMastocytosis, Cutaneous\n",
      "\t\tMastocytosis, Systemic\n",
      "\t\tCarney Complex\n",
      "\t\tNeurothekeoma\n",
      "\t\tFibroma, Ossifying\n",
      "\t\tGiant Cell Tumor of Bone\n",
      "\t\tOsteoblastoma\n",
      "\t\tOsteochondroma\n",
      "\t\tOsteoma\n",
      "\t\tOsteosarcoma\n",
      "\t\tFibroma\n",
      "\t\tFibrosarcoma\n",
      "\t\tHistiocytoma\n",
      "\t\tMyofibromatosis\n",
      "\t\tNeoplasms, Fibroepithelial\n",
      "\t\tSolitary Fibrous Tumors\n",
      "disease: Lung adenocarcinoma\n",
      "\tnode: C04.588.894.797.520\n",
      "\t\tRespiratory Tract Neoplasms\n",
      "\t\tAdenocarcinoma of Lung\n",
      "\t\tBronchial Neoplasms\n",
      "\t\tMultiple Pulmonary Nodules\n",
      "\t\tPancoast Syndrome\n",
      "\t\tPulmonary Blastoma\n",
      "\t\tPulmonary Sclerosing Hemangioma\n",
      "\t\tLung Neoplasms\n",
      "\t\tPleural Neoplasms\n",
      "\t\tTracheal Neoplasms\n",
      "\t\tAdenocarcinoma of Lung\n",
      "\t\tBronchial Neoplasms\n",
      "\t\tMultiple Pulmonary Nodules\n",
      "\t\tPancoast Syndrome\n",
      "\t\tPulmonary Blastoma\n",
      "\t\tPulmonary Sclerosing Hemangioma\n",
      "\t\tPleural Effusion, Malignant\n",
      "\t\tSolitary Fibrous Tumor, Pleural\n",
      "disease: Gastric cancer\n",
      "\tnode: C06.301.371.767\n",
      "\t\tGastrointestinal Neoplasms\n",
      "\t\tEsophageal Neoplasms\n",
      "\t\tGastrointestinal Stromal Tumors\n",
      "\t\tIntestinal Neoplasms\n",
      "\t\tStomach Neoplasms\n",
      "\t\tZollinger-Ellison Syndrome\n",
      "\t\tEsophageal Squamous Cell Carcinoma\n",
      "\t\tCecal Neoplasms\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tDuodenal Neoplasms\n",
      "\t\tIleal Neoplasms\n",
      "\t\tImmunoproliferative Small Intestinal Disease\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\t\tJejunal Neoplasms\n",
      "\tnode: C06.405.249.767\n",
      "\t\tGastrointestinal Neoplasms\n",
      "\t\tEsophageal Neoplasms\n",
      "\t\tGastrointestinal Stromal Tumors\n",
      "\t\tIntestinal Neoplasms\n",
      "\t\tStomach Neoplasms\n",
      "\t\tZollinger-Ellison Syndrome\n",
      "\t\tEsophageal Squamous Cell Carcinoma\n",
      "\t\tCecal Neoplasms\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tDuodenal Neoplasms\n",
      "\t\tIleal Neoplasms\n",
      "\t\tImmunoproliferative Small Intestinal Disease\n",
      "\t\tJejunal Neoplasms\n",
      "\tnode: C06.405.748.789\n",
      "\t\tStomach Diseases\n",
      "\t\tAchlorhydria\n",
      "\t\tDiverticulosis, Stomach\n",
      "\t\tDuodenogastric Reflux\n",
      "\t\tGastric Antral Vascular Ectasia\n",
      "\t\tGastric Dilatation\n",
      "\t\tGastric Outlet Obstruction\n",
      "\t\tGastritis\n",
      "\t\tGastroparesis\n",
      "\t\tPeptic Ulcer\n",
      "\t\tPostgastrectomy Syndromes\n",
      "\t\tStomach Neoplasms\n",
      "\t\tStomach Rupture\n",
      "\t\tStomach Volvulus\n",
      "\t\tZollinger-Ellison Syndrome\n",
      "\t\tBile Reflux\n",
      "\t\tPyloric Stenosis\n",
      "\t\tGastritis, Atrophic\n",
      "\t\tGastritis, Hypertrophic\n",
      "\t\tDuodenal Ulcer\n",
      "\t\tEsophagitis, Peptic\n",
      "\t\tPeptic Ulcer Perforation\n",
      "\t\tStomach Ulcer\n",
      "\t\tZollinger-Ellison Syndrome\n",
      "\t\tDumping Syndrome\n",
      "\tnode: C04.588.274.476.767\n",
      "\t\tGastrointestinal Neoplasms\n",
      "\t\tEsophageal Neoplasms\n",
      "\t\tIntestinal Neoplasms\n",
      "\t\tStomach Neoplasms\n",
      "\t\tEsophageal Squamous Cell Carcinoma\n",
      "\t\tCecal Neoplasms\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tDuodenal Neoplasms\n",
      "\t\tIleal Neoplasms\n",
      "\t\tJejunal Neoplasms\n",
      "disease: Cholangiocarcinoma\n",
      "\tnode: C04.557.470.200.025.450\n",
      "\t\tAdenocarcinoma\n",
      "\t\tKlatskin Tumor\n",
      "\t\tAdenocarcinoma in Situ\n",
      "\t\tAdenocarcinoma of Lung\n",
      "\t\tAdenocarcinoma, Clear Cell\n",
      "\t\tAdenocarcinoma, Follicular\n",
      "\t\tAdenocarcinoma, Mucinous\n",
      "\t\tAdenocarcinoma, Papillary\n",
      "\t\tAdenocarcinoma, Scirrhous\n",
      "\t\tAdenocarcinoma, Sebaceous\n",
      "\t\tAdrenocortical Carcinoma\n",
      "\t\tCarcinoid Tumor\n",
      "\t\tCarcinoma, Acinar Cell\n",
      "\t\tCarcinoma, Adenoid Cystic\n",
      "\t\tCarcinoma, Ductal\n",
      "\t\tCarcinoma, Endometrioid\n",
      "\t\tCarcinoma, Hepatocellular\n",
      "\t\tCarcinoma, Intraductal, Noninfiltrating\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Lobular\n",
      "\t\tCarcinoma, Mucoepidermoid\n",
      "\t\tCarcinoma, Neuroendocrine\n",
      "\t\tCarcinoma, Renal Cell\n",
      "\t\tCarcinoma, Signet Ring Cell\n",
      "\t\tCarcinoma, Skin Appendage\n",
      "\t\tCholangiocarcinoma\n",
      "\t\tChoriocarcinoma\n",
      "\t\tCystadenocarcinoma\n",
      "\t\tEccrine Porocarcinoma\n",
      "\t\tPaget Disease, Extramammary\n",
      "\t\tPulmonary Adenomatosis, Ovine\n",
      "\t\tAdenocarcinoma, Bronchiolo-Alveolar\n",
      "\t\tCarcinoma, Papillary, Follicular\n",
      "\t\tCarcinoma, Papillary, Follicular\n",
      "\t\tThyroid Cancer, Papillary\n",
      "\t\tLinitis Plastica\n",
      "\t\tMalignant Carcinoid Syndrome\n",
      "\t\tCarcinoma, Ductal, Breast\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tGastrinoma\n",
      "\t\tGlucagonoma\n",
      "\t\tCarcinoma, Medullary\n",
      "\t\tCarcinoma, Merkel Cell\n",
      "\t\tSomatostatinoma\n",
      "\t\tVipoma\n",
      "\t\tKrukenberg Tumor\n",
      "\t\tKlatskin Tumor\n",
      "\t\tChoriocarcinoma, Non-gestational\n",
      "\t\tTrophoblastic Tumor, Placental Site\n",
      "\t\tCystadenocarcinoma, Mucinous\n",
      "\t\tCystadenocarcinoma, Papillary\n",
      "\t\tCystadenocarcinoma, Serous\n",
      "disease: Cervical cancer\n",
      "\tnode: C13.351.500.852.593.131\n",
      "\t\tUterine Cervical Diseases\n",
      "\t\tUterine Cervical Dysplasia\n",
      "\t\tUterine Cervical Erosion\n",
      "\t\tUterine Cervical Incompetence\n",
      "\t\tUterine Cervical Neoplasms\n",
      "\t\tUterine Cervicitis\n",
      "\t\tAtypical Squamous Cells of the Cervix\n",
      "\t\tSquamous Intraepithelial Lesions of the Cervix\n",
      "\tnode: C13.351.500.852.762.850\n",
      "\t\tUterine Neoplasms\n",
      "\t\tEndometrial Neoplasms\n",
      "\t\tUterine Cervical Neoplasms\n",
      "\t\tEndometrial Stromal Tumors\n",
      "\tnode: C13.351.937.418.875.850\n",
      "\t\tUterine Neoplasms\n",
      "\t\tEndometrial Neoplasms\n",
      "\t\tUterine Cervical Neoplasms\n",
      "\t\tCarcinoma, Endometrioid\n",
      "\t\tEndometrial Stromal Tumors\n",
      "\tnode: C04.588.945.418.948.850\n",
      "\t\tUterine Neoplasms\n",
      "\t\tEndometrial Neoplasms\n",
      "\t\tUterine Cervical Neoplasms\n",
      "\t\tCarcinoma, Endometrioid\n",
      "disease: Pancreatic cancer\n",
      "\tnode: C04.588.274.761\n",
      "\t\tDigestive System Neoplasms\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\t\tBiliary Tract Neoplasms\n",
      "\t\tGastrointestinal Neoplasms\n",
      "\t\tLiver Neoplasms\n",
      "\t\tPancreatic Neoplasms\n",
      "\t\tPeritoneal Neoplasms\n",
      "\t\tBile Duct Neoplasms\n",
      "\t\tGallbladder Neoplasms\n",
      "\t\tEsophageal Neoplasms\n",
      "\t\tIntestinal Neoplasms\n",
      "\t\tStomach Neoplasms\n",
      "\t\tAdenoma, Liver Cell\n",
      "\t\tCarcinoma, Hepatocellular\n",
      "\t\tLiver Neoplasms, Experimental\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\tnode: C04.588.322.475\n",
      "\t\tEndocrine Gland Neoplasms\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\t\tAdrenal Gland Neoplasms\n",
      "\t\tMultiple Endocrine Neoplasia\n",
      "\t\tOvarian Neoplasms\n",
      "\t\tPancreatic Neoplasms\n",
      "\t\tParaneoplastic Endocrine Syndromes\n",
      "\t\tParathyroid Neoplasms\n",
      "\t\tPituitary Neoplasms\n",
      "\t\tTesticular Neoplasms\n",
      "\t\tThyroid Neoplasms\n",
      "\t\tAdrenal Cortex Neoplasms\n",
      "\t\tMultiple Endocrine Neoplasia Type 1\n",
      "\t\tMultiple Endocrine Neoplasia Type 2a\n",
      "\t\tMultiple Endocrine Neoplasia Type 2b\n",
      "\t\tCarcinoma, Ovarian Epithelial\n",
      "\t\tGranulosa Cell Tumor\n",
      "\t\tHereditary Breast and Ovarian Cancer Syndrome\n",
      "\t\tLuteoma\n",
      "\t\tMeigs Syndrome\n",
      "\t\tSertoli-Leydig Cell Tumor\n",
      "\t\tThecoma\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\t\tACTH-Secreting Pituitary Adenoma\n",
      "\t\tGrowth Hormone-Secreting Pituitary Adenoma\n",
      "\t\tProlactinoma\n",
      "\t\tSertoli-Leydig Cell Tumor\n",
      "\t\tThyroid Cancer, Papillary\n",
      "\t\tThyroid Nodule\n",
      "disease: Prostate cancer\n",
      "\tnode: C12.294.260.750\n",
      "\t\tGenital Neoplasms, Male\n",
      "\t\tProstatic Neoplasms, Castration-Resistant\n",
      "\t\tPenile Neoplasms\n",
      "\t\tProstatic Neoplasms\n",
      "\t\tTesticular Neoplasms\n",
      "\t\tProstatic Neoplasms, Castration-Resistant\n",
      "\t\tSertoli-Leydig Cell Tumor\n",
      "\tnode: C12.294.565.625\n",
      "\t\tProstatic Diseases\n",
      "\t\tProstatic Neoplasms, Castration-Resistant\n",
      "\t\tProstatic Hyperplasia\n",
      "\t\tProstatic Neoplasms\n",
      "\t\tProstatitis\n",
      "\t\tProstatic Neoplasms, Castration-Resistant\n",
      "\tnode: C12.758.409.750\n",
      "\t\tGenital Neoplasms, Male\n",
      "\t\tProstatic Neoplasms, Castration-Resistant\n",
      "\t\tPenile Neoplasms\n",
      "\t\tProstatic Neoplasms\n",
      "\t\tTesticular Neoplasms\n",
      "\t\tProstatic Neoplasms, Castration-Resistant\n",
      "\t\tSertoli-Leydig Cell Tumor\n",
      "\tnode: C04.588.945.440.770\n",
      "\t\tGenital Neoplasms, Male\n",
      "\t\tProstatic Neoplasms, Castration-Resistant\n",
      "\t\tPenile Neoplasms\n",
      "\t\tProstatic Neoplasms\n",
      "\t\tTesticular Neoplasms\n",
      "\t\tProstatic Neoplasms, Castration-Resistant\n",
      "\t\tSertoli-Leydig Cell Tumor\n",
      "disease: Colorectal cancer\n",
      "\tnode: C06.301.371.411.307\n",
      "\t\tIntestinal Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tRectal Neoplasms\n",
      "\t\tCecal Neoplasms\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tDuodenal Neoplasms\n",
      "\t\tIleal Neoplasms\n",
      "\t\tImmunoproliferative Small Intestinal Disease\n",
      "\t\tJejunal Neoplasms\n",
      "\t\tAppendiceal Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tRectal Neoplasms\n",
      "\tnode: C06.405.249.411.307\n",
      "\t\tIntestinal Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tRectal Neoplasms\n",
      "\t\tCecal Neoplasms\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tDuodenal Neoplasms\n",
      "\t\tIleal Neoplasms\n",
      "\t\tImmunoproliferative Small Intestinal Disease\n",
      "\t\tJejunal Neoplasms\n",
      "\t\tAppendiceal Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tRectal Neoplasms\n",
      "\tnode: C06.405.469.158.356\n",
      "\t\tColonic Diseases\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tChilaiditi Syndrome\n",
      "\t\tColitis\n",
      "\t\tColonic Diseases, Functional\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tDiverticulosis, Colonic\n",
      "\t\tMegacolon\n",
      "\t\tSigmoid Diseases\n",
      "\t\tColitis, Ischemic\n",
      "\t\tColitis, Microscopic\n",
      "\t\tColitis, Ulcerative\n",
      "\t\tProctocolitis\n",
      "\t\tColonic Pseudo-Obstruction\n",
      "\t\tIrritable Bowel Syndrome\n",
      "\t\tNeurogenic Bowel\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tDiverticulitis, Colonic\n",
      "\t\tHirschsprung Disease\n",
      "\t\tMegacolon, Toxic\n",
      "\t\tProctocolitis\n",
      "\t\tSigmoid Neoplasms\n",
      "\tnode: C06.405.469.491.307\n",
      "\t\tIntestinal Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tRectal Neoplasms\n",
      "\t\tCecal Neoplasms\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tDuodenal Neoplasms\n",
      "\t\tIleal Neoplasms\n",
      "\t\tImmunoproliferative Small Intestinal Disease\n",
      "\t\tJejunal Neoplasms\n",
      "\t\tAppendiceal Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tRectal Neoplasms\n",
      "\tnode: C06.405.469.860.180\n",
      "\t\tRectal Diseases\n",
      "\t\tRectal Neoplasms\n",
      "\t\tAnus Diseases\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tFecal Incontinence\n",
      "\t\tHemorrhoids\n",
      "\t\tProctitis\n",
      "\t\tRectal Fistula\n",
      "\t\tRectal Prolapse\n",
      "\t\tRectocele\n",
      "\t\tAnus Neoplasms\n",
      "\t\tFissure in Ano\n",
      "\t\tPruritus Ani\n",
      "\t\tRectal Neoplasms\n",
      "\t\tProctocolitis\n",
      "\t\tRectovaginal Fistula\n",
      "\tnode: C04.588.274.476.411.307\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\t\tIntestinal Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tRectal Neoplasms\n",
      "\t\tCecal Neoplasms\n",
      "\t\tColorectal Neoplasms\n",
      "\t\tDuodenal Neoplasms\n",
      "\t\tIleal Neoplasms\n",
      "\t\tJejunal Neoplasms\n",
      "\t\tAppendiceal Neoplasms\n",
      "\t\tAdenomatous Polyposis Coli\n",
      "\t\tColonic Neoplasms\n",
      "\t\tColorectal Neoplasms, Hereditary Nonpolyposis\n",
      "\t\tRectal Neoplasms\n",
      "disease: Pancreatic adenocarcinoma\n",
      "\tnode: C04.588.274.761\n",
      "\t\tDigestive System Neoplasms\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\t\tBiliary Tract Neoplasms\n",
      "\t\tGastrointestinal Neoplasms\n",
      "\t\tLiver Neoplasms\n",
      "\t\tPancreatic Neoplasms\n",
      "\t\tPeritoneal Neoplasms\n",
      "\t\tBile Duct Neoplasms\n",
      "\t\tGallbladder Neoplasms\n",
      "\t\tEsophageal Neoplasms\n",
      "\t\tIntestinal Neoplasms\n",
      "\t\tStomach Neoplasms\n",
      "\t\tAdenoma, Liver Cell\n",
      "\t\tCarcinoma, Hepatocellular\n",
      "\t\tLiver Neoplasms, Experimental\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\tnode: C04.588.322.475\n",
      "\t\tEndocrine Gland Neoplasms\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\t\tAdrenal Gland Neoplasms\n",
      "\t\tMultiple Endocrine Neoplasia\n",
      "\t\tOvarian Neoplasms\n",
      "\t\tPancreatic Neoplasms\n",
      "\t\tParaneoplastic Endocrine Syndromes\n",
      "\t\tParathyroid Neoplasms\n",
      "\t\tPituitary Neoplasms\n",
      "\t\tTesticular Neoplasms\n",
      "\t\tThyroid Neoplasms\n",
      "\t\tAdrenal Cortex Neoplasms\n",
      "\t\tMultiple Endocrine Neoplasia Type 1\n",
      "\t\tMultiple Endocrine Neoplasia Type 2a\n",
      "\t\tMultiple Endocrine Neoplasia Type 2b\n",
      "\t\tCarcinoma, Ovarian Epithelial\n",
      "\t\tGranulosa Cell Tumor\n",
      "\t\tHereditary Breast and Ovarian Cancer Syndrome\n",
      "\t\tLuteoma\n",
      "\t\tMeigs Syndrome\n",
      "\t\tSertoli-Leydig Cell Tumor\n",
      "\t\tThecoma\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\t\tACTH-Secreting Pituitary Adenoma\n",
      "\t\tGrowth Hormone-Secreting Pituitary Adenoma\n",
      "\t\tProlactinoma\n",
      "\t\tSertoli-Leydig Cell Tumor\n",
      "\t\tThyroid Cancer, Papillary\n",
      "\t\tThyroid Nodule\n",
      "disease: Pancreatic ductal adenocarcinoma\n",
      "\tnode: C19.344.421.750\n",
      "\t\tPancreatic Neoplasms\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\t\tInsulinoma\n",
      "\t\tGastrinoma\n",
      "\t\tGlucagonoma\n",
      "\t\tSomatostatinoma\n",
      "\t\tVipoma\n",
      "\tnode: C06.301.761.750\n",
      "\t\tPancreatic Neoplasms\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\t\tInsulinoma\n",
      "\t\tGastrinoma\n",
      "\t\tGlucagonoma\n",
      "\t\tSomatostatinoma\n",
      "\t\tVipoma\n",
      "\tnode: C06.689.667.625\n",
      "\t\tPancreatic Neoplasms\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\t\tInsulinoma\n",
      "\t\tGastrinoma\n",
      "\t\tGlucagonoma\n",
      "\t\tSomatostatinoma\n",
      "\t\tVipoma\n",
      "\tnode: C04.557.470.200.025.232.750\n",
      "\t\tCarcinoma, Ductal\n",
      "\t\tCarcinoma, Ductal, Breast\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\tnode: C04.557.470.615.132.750\n",
      "\t\tCarcinoma, Ductal\n",
      "\t\tCarcinoma, Ductal, Breast\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\tnode: C04.588.274.761.750\n",
      "\t\tPancreatic Neoplasms\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\t\tInsulinoma\n",
      "\t\tGastrinoma\n",
      "\t\tGlucagonoma\n",
      "\t\tSomatostatinoma\n",
      "\t\tVipoma\n",
      "\tnode: C04.588.322.475.750\n",
      "\t\tPancreatic Neoplasms\n",
      "\t\tAdenoma, Islet Cell\n",
      "\t\tCarcinoma, Islet Cell\n",
      "\t\tCarcinoma, Pancreatic Ductal\n",
      "\t\tPancreatic Intraductal Neoplasms\n",
      "\t\tInsulinoma\n",
      "\t\tGastrinoma\n",
      "\t\tGlucagonoma\n",
      "\t\tSomatostatinoma\n",
      "\t\tVipoma\n",
      "disease: Ampullary carcinoma\n"
     ]
    }
   ],
   "source": [
    "for (k,v) in disease_dict_mesh.items():\n",
    "    disease = k\n",
    "    nodes = getDiseaseTreeNode(v)\n",
    "    \n",
    "    print(\"disease: {}\".format(k))\n",
    "    for node in nodes:\n",
    "        if node.count(\".\") >= 3:\n",
    "            print(\"\\tnode: {}\".format(node))\n",
    "            othernodes = getAllTerms(node)\n",
    "            for othernode in othernodes:\n",
    "                print(\"\\t\\t{}\".format(getDiseaseName(getMeshidByNode(othernode))))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
